a = '''평소 물리 문제를 많이 풀면서 어떤 문제에 대한 답, 값만 많이 도출하는 연습만 했었다. 
그런데 <재미있는 물리여행>을 읽고 물리적 현상에 대해 해석을 하려니 그냥 문제를 푸는 것과 다른 느낌이 들었다. 
이상하게 어떻게 접근해야 하는지 모르겠고 내가 배운 내용을 어떻게 적용해야되는지도 막막하였다. 
그래서 친구들과 함께 머리를 맞댔다. 
책에 나온 문제 중에 ‘빗속을 달리는 차’라는 문제가 가장 논란(?)이었다.
비가 계속 열차에 들어오면서 질량은 증가하는데 왜 운동량이 변하지 않느냐가 문제였다.
답은 간단했다. 
충격량 I = Ft로 즉  운동량의 변화 I를 시간에 대해 미분한 것이 힘 F이 된다.
그런데 열차는 마찰이 없는 상태에서 등속 운동을 하기 때문에 x방향 힘이 없다.
따라서 운동량은 일정한 것이다. 
이렇게 해석할 수도 있지만 그냥 질량과 속도가 동시에 변하기 때문에 질량 변화만으로 운동량의 변화를 결정지을 수 없다. 
'''

print(a)
b = a.replace("\n", "")
print(b)
